# TAPS

# The `brew bundle` command
tap "homebrew/bundle"
# Formulae for 1Password CLI
tap "1password/tap"
# Formulae for Graphite CLI
tap "withgraphite/tap"
# Formulae for sshpass
tap "esolitos/ipa"

tap "railwaycat/emacsmacport"
# BINARIES

# GNU utilities, to replace default BSD ones
brew "coreutils"
brew "findutils"
brew "grep"
brew "gnu-sed"
brew "stow"

# Get latest version of the OpenSSH utilities
# Disabled to not mess with Keychain integration
# brew "openssh"
# brew "ssh-copy-id"
brew "esolitos/ipa/sshpass"

# The `wget` command
brew "wget"

# Other miscellaneous binaries
brew "ack"
brew "graphviz"
brew "imagemagick"
brew "jq"
brew "less"
brew "mackup"    # Python
brew "mas"       # Swift
brew "mkcert"    # Golang
brew "neofetch"
brew "p7zip"
brew "pigz"
brew "pkg-config"
brew "protobuf" # Python
brew "readline"
brew "sqlmap"
brew "tealdeer" # Rust
brew "tree"
brew "xz"
brew "yq" # Golang
brew "zlib"
brew "zopfli"

# General development tools
brew "cmake"
brew "gh" # Golang
brew "git"
brew "git-absorb" # Rust
brew "mise"       # Rust
brew "nginx"
brew "shellcheck"
brew "terraform"
brew "watchman"                  # Python
brew "withgraphite/tap/graphite" # Node.js
brew "xh"                        # Rust

# Database related tools
brew "postgresql@15"
brew "sqlite"

# Docker related tools
brew "hadolint"       # Haskell
brew "helm"           # Golang
brew "k9s"            # Golang
brew "kustomize"      # Golang
brew "minikube"       # Golang

brew "awscli"                # Python

# Tools to optimise images
brew "jpegoptim"
brew "pngquant" # Rust
brew "optipng"

# Migrated from old Mac
brew "ack"
brew "act"
brew "zstd"
brew "little-cms2"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "openssl@3"
brew "glib"
brew "harfbuzz"
brew "apache-geode"
brew "argo"
brew "m4"
brew "autoconf"
brew "automake"
brew "coreutils"
brew "asdf"
brew "azcopy"
brew "python@3.11"
brew "azure-cli"
brew "bash"
brew "bash-completion@2"
brew "binutils"
brew "bison"
brew "certbot"
brew "cfssl"
brew "cmake"
brew "conftest"
brew "curl"
brew "cypher-shell"
brew "delve"
brew "diffutils"
brew "direnv"
brew "duckdb"
brew "ed"
brew "unbound"
brew "gnutls"
brew "fasd"
brew "fd"
brew "gcc"
brew "libass"
brew "libbluray"
brew "librist"
brew "pango"
brew "srt"
brew "tesseract"
brew "ffmpeg"
brew "file-formula"
brew "findutils"
brew "flex"
brew "flock"
brew "fzf"
brew "libavif"
brew "gd"
brew "gdk-pixbuf"
brew "ghostscript"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-which"
brew "gnupg"
brew "go"
brew "gobject-introspection"
brew "gomodifytags"
brew "gotests"
brew "gpatch"
brew "gradle"
brew "netpbm"
brew "gts"
brew "librsvg"
brew "graphviz"
brew "grep"
brew "guile"
brew "gzip"
brew "httpie"
brew "shared-mime-info"
brew "libheif"
brew "libraw"
brew "imagemagick"
brew "ispell"
brew "istioctl"
brew "jo"
brew "jsonnet"
brew "kind"
brew "ko"
brew "krew"
brew "kubecfg"
brew "kubectx"
brew "lapack"
brew "lastpass-cli"
brew "ldns"
brew "less"
brew "libfido2"
brew "libgccjit"
brew "libpq"
brew "libressl"
brew "libslirp"
brew "vde"
brew "qemu"
brew "llvm"
brew "luv"
brew "lynx"
brew "ruby"
brew "make"
brew "mas"
brew "maven"
brew "minikube"
brew "mkcert"
brew "mkdocs"
brew "nano"
brew "neovim"
brew "netcat"
brew "nmap"
brew "node"
brew "nss"
brew "openssh"
brew "pandoc"
brew "parallel"
brew "perl"
brew "pgcli"
brew "pipx"
brew "plantuml"
brew "poetry"
brew "protobuf"
brew "pwgen"
brew "pyenv"
brew "ruby-build"
brew "rbenv"
brew "ripgrep"
brew "roswell"
brew "rsync"
brew "screen"
brew "skaffold"
brew "sops"
brew "stern"
brew "telnet"
brew "terraform"
brew "tilt"
brew "tmux"
brew "tree"
brew "unzip"
brew "watch"
brew "wdiff"
brew "wget"
brew "yarn"
brew "zsh"
brew "zsh-completions"
brew "railwaycat/emacsmacport/emacs-mac", args: ["with-librsvg", "with-mac-metal", "with-native-compilation", "with-starter"]


# CASKS

# Binaries and Drivers
cask "google-cloud-sdk"
cask "mitmproxy" # Python
cask "zulu17"

# Browsers
cask "microsoft-edge"

# Utilities
cask "1password"
cask "1password/tap/1password-cli"
cask "karabiner-elements"
cask "linear-linear"
cask "logi-options-plus"
cask "mimestream"
cask "morgen"
cask "mullvadvpn"

# IM
cask "slack"

# Development
cask "dash"
cask "flipper"
cask "gitbutler"
cask "gpg-suite"
cask "httpie"
cask "jetbrains-toolbox"
cask "orbstack"
cask "visual-studio-code"

# Migrated casks from old macbook
cask "1password"
cask "astro-command-center"
cask "battle-net"
cask "betterdisplay"
cask "bettermouse"
cask "brave-browser"
cask "caffeine"
cask "calibre"
cask "chatgpt"
cask "cursor"
cask "dash"
cask "docker"
cask "firefox"
cask "flycut"
cask "font-hack-nerd-font"
cask "google-cloud-sdk"
cask "grandperspective"
cask "hammerspoon"
cask "iterm2"
cask "jdk-mission-control"
cask "jetbrains-toolbox"
cask "libreoffice"
cask "macfuse"
cask "mactex"
cask "mambaforge"
cask "memoryanalyzer"
cask "microsoft-edge"
cask "monodraw"
cask "plex-htpc"
cask "postman"
cask "rectangle-pro"
cask "skype"
cask "smoothscroll"
cask "steelseries-engine"
cask "temurin"
cask "touchswitcher"
cask "turbo-boost-switcher"
cask "ubiquiti-unifi-controller"
cask "ukelele"
cask "visual-studio-code"
cask "visualvm"
cask "vlc"
cask "whatsapp"
cask "wireshark"
cask "zotero"


vscode "alefragnani.project-manager"
vscode "doublebot.doublebot"
vscode "github.codespaces"
vscode "golang.go"
vscode "haskell.haskell"
vscode "hbenl.vscode-test-explorer"
vscode "hbenl.vscode-test-explorer-liveshare"
vscode "justusadam.language-haskell"
vscode "k--kato.intellij-idea-keybindings"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vsliveshare.vsliveshare"
vscode "redhat.vscode-yaml"
